In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
import csv

data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
'Age': [20, 21, 22, 20, 23],
'Math': [85, 90, 78, 92, 88],
'Science': [92, 88, 95, 89, 84],
'History': [78, 85, 88, 92, 90]
}

# Converting Data into DataFrame

In [2]:
df = pd.DataFrame(data)
df

      Name  Age  Math  Science  History
0    Alice   20    85       92       78
1      Bob   21    90       88       85
2  Charlie   22    78       95       88
3    David   20    92       89       92
4      Eva   23    88       84       90

# Adding New Columns For Subjects Average

In [3]:
df['Math Average'] = df['Math'].mean()
df['Science Average'] = df['Science'].mean()
df['History Average'] = df['History'].mean()
df.head()

,Name,Age,Math,Science,History,Math Average,Science Average,History Average
0,Alice,20,85,92,78,86.6,89.6,86.6
1,Bob,21,90,88,85,86.6,89.6,86.6
2,Charlie,22,78,95,88,86.6,89.6,86.6
3,David,20,92,89,92,86.6,89.6,86.6
4,Eva,23,88,84,90,86.6,89.6,86.6

In [4]:
df.describe()

,Age,Math,Science,History,Math Average,Science Average,History Average
count,5.00000,5.000000,5.000000,5.000000,5.0,5.0,5.0
mean,21.20000,86.600000,89.600000,86.600000,86.6,89.6,86.6
std,1.30384,5.458938,4.159327,5.458938,0.0,0.0,0.0
min,20.00000,78.000000,84.000000,78.000000,86.6,89.6,86.6
25%,20.00000,85.000000,88.000000,85.000000,86.6,89.6,86.6
50%,21.00000,88.000000,89.000000,88.000000,86.6,89.6,86.6
75%,22.00000,90.000000,92.000000,90.000000,86.6,89.6,86.6
max,23.00000,92.000000,95.000000,92.000000,86.6,89.6,86.6

# Student with Highest Average Grade

In [5]:
student_with_highest_avg_grade = df.iloc[df[['Math Average', 'Science Average', 'History Average']].mean(axis=1).idxmax()]
print("Student with Highest Average Grades")
student_with_highest_avg_grade

Student with Highest Average Grades

Name               Alice
Age                   20
Math                  85
Science               92
History               78
Math Average        86.6
Science Average     89.6
History Average     86.6
Name: 0, dtype: object

# Student With Highest Standard Deviation

In [6]:
stddevmath = df['Math'].std()
stddevscience = df['Science'].std()
stddevhistory = df['History'].std()
print("STD DEV MATH: ", stddevmath)
print("STD DEV SCIENCE: ", stddevscience)
print("STD DEV HISTORY: ", stddevhistory)

STD DEV MATH:  5.458937625582473
STD DEV SCIENCE:  4.159326868617084
STD DEV HISTORY:  5.458937625582473

In [7]:
final = {
    'Highest Average Grade Student': [student_with_highest_avg_grade["Name"], student_with_highest_avg_grade["Name"], student_with_highest_avg_grade["Name"]],
    'Subject': ['Math', 'Science', 'History'],
    'Average Grade': [
        df['Math Average'].mean(),
        df['Science Average'].mean(),
        df['History Average'].mean()
    ],
    'Standard Deviation': [stddevmath, stddevscience, stddevhistory]
}
final

{'Highest Average Grade Student': ['Alice', 'Alice', 'Alice'],
 'Subject': ['Math', 'Science', 'History'],
 'Average Grade': [86.6, 89.6, 86.6],
 'Standard Deviation': [5.458937625582473,
  4.159326868617084,
  5.458937625582473]}

# Converting Resultant Final Data into DataFrame

In [8]:
result_df = pd.DataFrame(final)
result_df

  Highest Average Grade Student  Subject  Average Grade  Standard Deviation
0                         Alice     Math           86.6            5.458938
1                         Alice  Science           89.6            4.159327
2                         Alice  History           86.6            5.458938

# Exporting Data To CSV File Format

In [9]:
result_df.to_csv("./Student_Data.csv")